app/Database/Migrations/2023-02-18-093010_Userstable.php

            array('id' => "2", 'user_type' =>"IG" , 'first_name' =>"Tester",'last_name' =>"Beta" , 'email' =>"tester2@email.com" , 'password' =>"$2y$10\$Ypq1v88iIpL0YUS6ohLSmeXauetxqcW4GEnIHolBVlgxdcNFZwBLC",'created_at' =>"2023-02-18 13:15:48",'updated_at' =>"2023-02-18 13:15:48"),//password2
            array('id' => "3", 'user_type' =>"C" , 'first_name' =>"Tester",'last_name' =>"Gamma" , 'email' =>"tester3@email.com" , 'password' =>"$2y$10\$hx/.7iotMTN1Q2UNrbAdk.PLZo63/mEtN9cA9jIvGh.d0uesw0RAO",'created_at' =>"2023-02-18 13:16:18",'updated_at' =>"2023-02-18 13:16:18")//password3
         );
        $this->db->table('user_login')->insertbatch($data);
---
INSERT INTO `user_login` (`created_at`, `email`, `first_name`, `id`, `last_name`, `password`, `updated_at`, `user_type`)
VALUES ('2023-02-18 13:15:15','tester1@email.com','Tester','1','Alpha','$2y$10$.NEeimnC82WGg0822dYq.eyYjQu4ocMXedPVaIGXoFuNWokVmdICi','2023-02-18 13:15:15','RM'), ('2023-02-18 13:15:48','tester2@email.com','Tester','2','Beta','$2y$10$Ypq1v88iIpL0YUS6ohLSmeXauetxqcW4GEnIHolBVlgxdcNFZwBLC','2023-02-18 13:15:48','IG'), ('2023-02-18 13:16:18','tester3@email.com','Tester','3','Gamma','$2y$10$hx/.7iotMTN1Q2UNrbAdk.PLZo63/mEtN9cA9jIvGh.d0uesw0RAOpassword3','2023-02-18 13:16:18','C')